lkolbly/cmsis-svd/data/Freescale/MKM13Z5.svd
        <register>
          <name>MATCR</name>
          <description>Master Attribute Configuration Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ATC0</name>
              <description>Attribute Configuration Master n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00x</name>
                  <description>Master attributes are statically forced to {privileged, secure}.</description>
                  <value>#00x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Master attributes are statically forced to {user, secure}.</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Master attributes are statically forced to {user, nonsecure}.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Enable master attribute {privileged or user} and statically force {secure}.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Enable master attribute {privileged or user} and statically force {nonsecure}.</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11x</name>
                  <description>Enable master attribute {privileged or user, secure or nonsecure}</description>
                  <value>#11x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RO0</name>
              <description>Read-Only Master n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writes to the ATCn are allowed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writes to the ATCn are ignored.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATC2</name>
              <description>Attribute Configuration Master n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00x</name>
                  <description>Master attributes are statically forced to {privileged, secure}.</description>
                  <value>#00x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>Master attributes are statically forced to {user, secure}.</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>Master attributes are statically forced to {user, nonsecure}.</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>Enable master attribute {privileged or user} and statically force {secure}.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>Enable master attribute {privileged or user} and statically force {nonsecure}.</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11x</name>
                  <description>Enable master attribute {privileged or user, secure or nonsecure}</description>
                  <value>#11x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RO2</name>
              <description>Read-Only Master n</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Writes to the ATCn are allowed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Writes to the ATCn are ignored.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
